In [51]:

import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [52]:

import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3])

print("Table created successfully")
conn.close()

Opened database successfully
Table created successfully

In [53]:
import sqlite3
conn=sqlite3.connect("test.db")
print ("Opened database successfully")
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
        VALUES (11, 'Paul', 32, 'California', 20000.00 )");
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (12, 'Allen', 25, 'Texas', 15000.00 )");
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
          VALUES (13, 'Teddy', 23, 'Norway', 20000.00 )");
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
          VALUES (14, 'Mark', 25, 'Rich-Mond ', 65000.00 )");
conn.commit()
print ("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

In [48]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('test.db')
print ("Opened database successfully")
conn.execute("DELETE from COMPANY where ID = 3;")
conn.commit()
print ("Total number of rows deleted :", conn.total_changes)
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3])
print (pd.read_sql_query("SELECT * FROM COMPANY", conn))
print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows deleted : 1
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0
ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0
ID =  11
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0
ID =  12
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0
ID =  13
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0
ID =  14
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0
   ID   NAME  AGE     ADDRESS   SALARY
0   1   Paul   32  California  25000.0
1   4   Mark   25  Rich-Mond   65000.0
2  11   Paul   32  California  20000.0
3  12  Allen   25       Texas  15000.0
4  13  Teddy   23      Norway  20000.0
5  14   Mark   25  Rich-Mond   65000.0
Operation done successfully

In [54]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute("UPDATE COMPANY set SALARY = 27000.00 where ID = 3")
conn.commit()
print ("Total number of rows updated :", conn.total_changes)
print (pd.read_sql_query("SELECT * FROM COMPANY", conn))
print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows updated : 0
   ID   NAME  AGE     ADDRESS   SALARY
0  11   Paul   32  California  20000.0
1  12  Allen   25       Texas  15000.0
2  13  Teddy   23      Norway  20000.0
3  14   Mark   25  Rich-Mond   65000.0
Operation done successfully

In [49]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute("DROP TABLE IF EXISTS COMPANY;")
conn.commit()
print ("DELETED successfully")
conn.close()

Opened database successfully
DELETED successfully